zww546/ESPDMX/stagedmx_std/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB Flash + 自定义分区
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 控制台走 USB-Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FATFS 长文件名（灯库文件名如 "omarte_ares_p7_34_channels.xml" 远超 8.3 限制）
CONFIG_FATFS_LFN_NONE=n
CONFIG_FATFS_LFN_HEAP=y

# 逻辑扇区 512（专业控台 U盘兼容标准）
CONFIG_FATFS_SECTOR_512=y
CONFIG_WL_SECTOR_SIZE_512=y

# FreeRTOS 1000Hz
CONFIG_FREERTOS_HZ=1000

# 蓝牙 NimBLE（从机/广播）
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# CONFIG_BT_NIMBLE_ROLE_CENTRAL is not set
# CONFIG_BT_NIMBLE_ROLE_OBSERVER is not set
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
# host_task 会在其内做文件列表/挂载等大栈操作，默认 4KB 太小会栈溢出
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# USB MSC U盘模式 (TinyUSB)
CONFIG_TINYUSB=y
CONFIG_TINYUSB_MSC_ENABLED=y
# MSC 写缓冲必须 >= WL sector size (4096)，否则 tinyusb_msc_new_storage_spiflash 会拒绝创建
CONFIG_TINYUSB_MSC_BUFSIZE=4096
CONFIG_TINYUSB_MSC_MOUNT_PATH="/fw"
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_HID_ENABLED=n
# PSRAM 用于 RAM 盘
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# 增大 malloc 上限以容纳 RAM 盘
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
